app/views/users/likes.html.erb

		<% @likes.each do |like| %>
		<% post =Post.find_by(id: like.post_id) %>
		<% user =User.find_by(id: post.user_id) %>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 53], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]