app/views/posts/show.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 12], ["post_id", 63], ["LIMIT", 1]]
---

			<% if Like.find_by(user_id: @current_user.id, post_id: @post.id) %>