app/controllers/likes_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 63], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at", "post_users_id") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["post_id", 63], ["created_at", 2018-02-03 15:02:33 UTC], ["updated_at", 2018-02-03 15:02:33 UTC], ["post_users_id", "7"]]
---
	def create
        @post = Post.find_by(id: params[:post_id])

		@like = Like.new(
			user_id: @current_user.id,
			post_id: params[:post_id],
			post_users_id: @post.user_id
			)
		@like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 2], ["post_id", 63], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 50]]
---
    def destroy
    	@like = Like.find_by(
    		user_id: @current_user.id,
    		post_id: params[:post_id]
    		)
    	@like.destroy