app/controllers/posts_controller.rb

  def create
  	@post=Post.new(content: params[:content],
                    user_id: @current_user.id)
    @post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "吠えるのも楽じゃないんだけど"], ["user_id", 7], ["created_at", "2018-01-28 06:01:19.408956"], ["updated_at", "2018-01-28 06:01:19.408956"]]

  def update
  	@post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "それ生クリームじゃなくて歯磨き粉だよね\r\n"], ["updated_at", "2018-01-14 07:15:17.951403"], ["id", 9]]

   def show
     @post = Post.find_by(id: params[:id])
     @user = @post.user
     @likes_count = Like.where(post_id: @post.id).count
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 63]]