app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "image_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "egg"], ["email", "egg@gmail.com"], ["image_name", "default_image.jpg"], ["created_at", "2018-01-21 09:00:22.772162"], ["updated_at", "2018-01-21 09:00:22.772162"]]
---
  def create
  	@user =User.new(name: params[:name],
                    email: params[:email],
                    password: params[:password],
                    image_name: "default_user.jpg"
                    )

  	if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 11]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_user_id" = ?  [["post_user_id", 9]]
---
  def show
  	@user = User.find_by(id: params[:id])
    @posts = Post.where(user_id: @user.id)
    @likes = Like.where(post_user_id: @user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "nomizuno"], ["email", "m0610@gmail.com"], ["updated_at", "2018-01-20 08:06:43.904916"], ["id", 1]]
---
  def update
  	@user = User.find_by(id: params[:id])
  	@user.name = params[:name]
  	@user.email = params[:email]
    @user.password = params[:password]
    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}",image.read)
    end

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT 1  [["email", "wanko@gmail.com"], ["password", "wan"]]
---
  def login
    @user = User.find_by(email: params[:email], password: params[:password])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 12]]
---
  def likes
    @user = User.find_by(id: params[:id])
    @likes = Like.where(user_id: @user.id)